# Напишите программу, которая найдёт произведение 
# пар чисел списка. Парой считаем первый и последний 
# элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
my_list = [2, 3, 4, 5, 6, 7, 8]
list_1 = my_list[:round(len(my_list)/2)]
list_2 = my_list[len(my_list): round(len(my_list)/2)-2: -1]
print(*map(lambda x, y: x*y, list_1, list_2))